Repository: Octachron/babilim
Catalog: translations/*.po
Languages: fr

source: Bad module name: the source file name is not a valid OCaml module name.
fr: Nom de module problématique : le nom du fichier source n'est pas un nom de module OCaml valide.

source: Cannot assign field %a of the private type %a
fr: Affecter le champ %a du type privé %a est impossible

source: Cannot create values of the private type %a
fr: Créer des valeurs du type privé %a est impossible

source: Cannot inline: %a
fr: Impossible d'inliner: %a

source: Cannot instantiate the virtual class %a
fr: La classe virtuelle %a ne peut être instanciée

source: Characters %i-%i:@,
fr: Caractères %i-%i:@,

source: Code should not depend on the actual values of this constructor's arguments. They are only for information and may change in future versions. (See manual section 8.5)
fr: Nul code ne devrait dépendre de la valeur précise des arguments de ce constructeur. Ils ne sont là qu'à titre informatif et pourraient changer dans de futures versions. (Voir le manuel, section 8.5)

source: Constructor or label name used out of scope.
fr: Ce nom de constructeur ou d'étiquette est utilisé hors de sa portée.

source: Definition
fr: Définition

source: Deprecated feature.
fr: Fonctionnalité dépréciée.

source: Deprecated: now part of warning 8.
fr: Déprécié : fait désormais partie de l'avertissement 8.

source: Disambiguated constructor or label name (compatibility warning).
fr: Nom de constructeur ou d'étiquette ambigu (avertissement de compatibilité).

source: Don't know how to unbox this type. Only float, int32, int64 and nativeint can be unboxed
fr: Je ne sais pas comment dépaqueter ce type. Seuls les float, int32, int64 et nativeint peuvent être dépaquetés

source: Don't know how to untag this type. Only int can be untagged
fr: Je ne sais pas comment démarquer ce type. Seuls les entiers peuvent être démarqués

source: Error
fr: Erreur

source: Error in environment variable.
fr: Erreur dans une variable d'environnement.

source: Expected declaration
fr: Déclaration attendue

source: Expected signature
fr: Signature attendue

source: Expression on the left-hand side of a sequence that doesn't have type "unit" (and that is not a function, see warning number 5).
fr: L'expression à gauche de la séquence n'a pas pour type "unit" (et ce n'est pas une fonction, voir l'avertissement N°5).

source: External identifiers must be functions
fr: Les identifiants externes doivent être des fonctions

source: Fields number %i have different names, %s and %s
fr: Les noms, %2$s et %3$s, du champ N°%1$i sont différents

source: File "
fr: Fichier "

source: Fragile constant pattern.
fr: Motif constant fragile.

source: Fragile pattern matching: matching that will remain complete even if additional constructors are added to one of the variant types matched.
fr: Filtrage de motif fragile : le filtrage restera complet même si des constructeurs de type additionnels étaient ajoutés au type variant filtré.

source: Function application with no argument.
fr: Application de fonction sans argument.

source: Function information unavailable
fr: Information de fonction non disponible

source: Functor application not allowed here.
fr: Une application de foncteur n'est pas autorisée ici.

source: I/O error: %s
fr: Erreur E/S : %s

source: Ill-formed list of warnings
fr: Liste d'avertissements mal-formée

source: Illegal attribute payload.
fr: Chargement illégal pour l'attribut.

source: Illegal backslash escape in a string constant.
fr: Barre oblique inversée illégale dans une chaîne de caractère constante.

source: Illegal open object type%a
fr: Type d'objet ouvert illégal%a

source: Illegal permutation of structure fields
fr: Permutation illégale des champs d'une structure

source: Illegal recursive module reference
fr: Référence illégale à un module récursif

source: Implicit elimination of optional arguments.
fr: Élimination implicite des arguments optionnels.

source: In hook %S:
fr: Dans l'attache %S :

source: In module %a:@
fr: Dans le module %a :@

source: In this program,@ variant constructors@ `%s and `%s@ have the same hash value.@ Change one of them.
fr: Dans ce programme,@ les constructeurs de variant `%s et `%s@ partagent la même valeur de hash.@ Changez l'un d'entre eux.

source: In this scoped type, variable '%s is reserved for the local type %s.
fr: Dans ce type, la variable '%s est réservée pour le type local %s.

source: Innocuous unused variable: unused variable that is not bound with "let" nor "as", and doesn't start with an underscore ("_") character.
fr: Variable inutilisée inoffensive : la variable inutilisée est déclarée ni avec "let" ni avec "as" et ne commence pas par un caractère tiret bas ("_").

source: Instance variable overridden.
fr: Variable d'instance réécrite.

source: Integer literal exceeds the range of representable integers of type %s
fr: Cette constante entière excède l'intervalle des entiers représentables par le type %s

source: Internal error: invalid [%@%@%@ocaml.ppx.context { %s }] bool syntax
fr: Erreur interne : syntaxe invalide [%@%@%@ocaml.ppx.context { %s }] pour un booléen

source: Internal error: invalid [%@%@%@ocaml.ppx.context { %s }] list syntax
fr: Erreur interne : syntaxe invalide [%@%@%@ocaml.ppx.context { %s }] pour une liste

source: Internal error: invalid [%@%@%@ocaml.ppx.context { %s }] option syntax
fr: Erreur interne : syntaxe invalide [%@%@%@ocaml.ppx.context { %s }] pour une option

source: Internal error: invalid [%@%@%@ocaml.ppx.context { %s }] pair syntax
fr: Erreur interne : syntaxe invalide [%@%@%@ocaml.ppx.context { %s }] pour une paire

source: Internal error: invalid [%@%@%@ocaml.ppx.context { %s }] string syntax
fr: Erreur interne : syntaxe invalide [%@%@%@ocaml.ppx.context { %s }] pour une chaîne de caractère

source: Internal error: invalid [%@%@%@ocaml.ppx.context] syntax
fr: Erreur interne : syntaxe invalide [%@%@%@ocaml.ppx.context]

source: Invalid [%%extension_constructor] payload, a constructor is expected.
fr: Charge invalide pour [%%extension_constructor], un constructeur est attendu.

source: Invalid syntax for extension '%s'.
fr: Syntaxe invalide pour l'extension '%s'.

source: Invalid syntax for sub-error of extension '%s'.
fr: Syntaxe invalide pour la sous-erreur d'extension '%s'.

source: It was expected to be %a,@ but it is %a.
fr: Il était attendu %a,@ mais il s'agit de %a.

source: Its type contains local dependencies:@ %a
fr: Son type contient des dépendances locales :@ %a

source: Label omitted in function application.
fr: Étiquette omise lors d'une application de fonction.

source: Let with no bindings.
fr: "Let" sans déclarations.

source: Method overridden.
fr: Méthode réécrite.

source: Missing cmx file
fr: Fichier cmx manquant

source: Missing fields in a record pattern.
fr: Champs manquants dans un motif d'enregistrement.

source: Module %a cannot be aliased
fr: Le module %a ne peut être aliasé

source: Modules are not allowed in this pattern.
fr: Les modules ne sont pas autorisés dans ce motif.

source: Multiple constraints for type %a
fr: Contraintes multiples pour le type %a

source: Non-principal type.
fr: Type non-principal.

source: Non-returning statement.
fr: Cette phrase ne retourne jamais.

source: None of the patterns in this 'match' expression match values.
fr: Aucun des motifs dans cette expression 'match' n'est compatible avec une valeur.

source: Nonoptional label applied as optional.
fr: Un argument nommé non-optionnel a été appliqué comme s'il était optionnel.

source: OCaml and preprocessor have incompatible versions
fr: OCaml et le préprocesseur ont des versions incompatibles

source: Only variables are allowed as left-hand side of `let rec'
fr: Seules des variables sont autorisées à gauche d'un `let rec'

source: Open statement shadows an already defined identifier.
fr: Une déclaration d'ouverture dissimule un identifiant déjà défini.

source: Open statement shadows an already defined label or constructor.
fr: Une déclaration d'ouverture dissimule une étiquette ou un constructeur.

source: Over-application
fr: Fonction appliquée à trop d'arguments

source: Partial application
fr: Application partielle

source: Partial match: missing cases in pattern-matching.
fr: Filtrage incomplet : des cas sont manquants dans le filtrage de motif.

source: Partially applied function: expression whose result has function type and is ignored.
fr: Application partielle de fonction: expression dont le résultat a un type fonctionnel et est ignoré.

source: Preprocessor warning.
fr: Avertissement du préprocesseur.

source: Private method made public implicitly.
fr: Méthode privée rendue publique implicitement.

source: Records cannot be empty.
fr: Les enregistrements ne peuvent être vides.

source: Recursive local constraint when unifying
fr: Contrainte locale et récursive rencontrée lors de l'unification

source: Recursive modules require an explicit module type.
fr: Les modules récursifs requièrent un type de module explicite.

source: Redundant case in a pattern matching (unused match case).
fr: Cas redondant dans le filtrage de motif (cas inutilisé).

source: Redundant sub-pattern in a pattern-matching.
fr: Sous-cas redondant dans un filtrage de motif.

source: Suspicious unused variable: unused variable that is bound with "let" or "as", and doesn't start with an underscore ("_") character.
fr: Variable inutilisée suspecte : cette variable inutilisée est déclarée avec "let" ou "as", et ne commence pas par un caractère tiret bas ("_") .

source: Suspicious-looking end-of-comment mark.
fr: Marque de fin de commentaire suspecte.

source: Suspicious-looking start-of-comment mark.
fr: Marque de début de commentaire suspecte.

source: Syntax error
fr: Erreur de syntaxe

source: Syntax error: %s expected.
fr: Erreur de syntaxe : %s attendu.

source: Syntax error: %s not expected.
fr: Erreur de syntaxe: %s inattendu.

source: Syntax error: '%s' expected
fr: Erreur de syntaxe : '%s' attendu

source: Syntax error: '%s' expected, the highlighted '%s' might be unmatched
fr: Erreur de syntaxe : '%s' attendu, le '%s' souligné pourrait être désapparié

source: Syntax error: applicative paths of the form F(X).t are not supported when the option -no-app-func is set.
fr: Erreur de syntaxe: les chemins applicatifs de la forme F(X).t ne sont pas supportés lorsque -no-app-func est utilisé.

source: The %s `%a' is required but not provided
fr: Le %s `%a' est requis mais n'est pas fourni

source: The arities for field %s differ
fr: Les arités pour le champ %s diffèrent

source: The attribute '%s' should be attached to a direct argument or result of the primitive, it should not occur deeply into its type
fr: L'attribut %s devrait être attaché à un argument direct ou au résultat de la primitive, et ne devrait pas apparaître loin à l'intérieur de son type

source: The class constraints are not consistent.@.
fr: Les contraintes de classes ne sont pas consistantes.@.

source: The classes do not have the same number of type parameters
fr: Les classes n'ont pas le même nombre de paramètres de types

source: The constructor %a@ belongs to one of the following variant types:
fr: Le constructeur %a@ appartient à l'un des types de variants suivants :

source: The constructor %a@ belongs to the variant type
fr: Le constructeur %a@ appartient au type variant

source: The constructor %a@ has type
fr: Le constructeur %a@ a pour type

source: The constructor %s does not belong to type %a@]
fr: Le constructeur %s n'appartient pas au type %a@]

source: The definition of type %a@ is unavailable
fr: La définition du type %a@ n'est pas disponible

source: The expression "new %s" has type
fr: Cette expression "new %s" a pour type

source: The field %a@ belongs to one of the following record types:
fr: Le champ %a@ appartient à l'un des types enregistrements suivants :

source: The field %a@ belongs to the record type
fr: Le champ %a@ appartient au type enregistrement

source: The field %s does not belong to type %a@]
fr: Le champ %s n'appartient pas au type %a@]

source: The field %s is only present in the first declaration
fr: Le champ %s est seulement présent dans la première déclaration

source: The field %s is only present in the original definition
fr: Le champ %s est seulement présent dans la définition originelle

source: The field %s is only present in the second declaration
fr: Le champ %s est seulement présent dans la seconde déclaration

source: The field %s is only present in the type definition
fr: Le champ %s est seulement présent dans la définition du type

source: The field %s is only present in this definition
fr: Le champ %s est seulement présent dans cette définition

source: The field %s is only present in this extension definition
fr: Le champ %s est seulement présent dans cette extension de définition

source: The instance variable %a@ cannot be accessed from the definition of another instance variable
fr: La variable d'instance %a@ ne peut être accédée dans la définition d'une autre variable d'instance

source: The instance variable %s is not mutable
fr: La variable d'instance %s n'est pas mutable

source: The instance variable %s is overridden several times
fr: La variable d'instance %s est réécrite plusieurs fois

source: The instance variable %s@ has type
fr: La variable d'instance %s@ a pour type

source: The instance variable %s@ has type@;<1 2>%a@ where@ %a@ is unbound
fr: La variable d'instance %s@ a pour type @;<1 2>%a@ où@ %a@ n'est pas liée

source: The method %s@ has type
fr: La méthode %s@ a pour type

source: The method %s@ has type@;<1 2>%a@ where@ %a@ is unbound
fr: La méthode %s@ a pour type@;<1 2>%a@ où@ %a@ n'est pas liée

source: The module %a is an alias for module %a, which is missing
fr: Le module %a est un alias pour le module %a, qui est manquant

source: The mutability of field %s is different
fr: La mutabilité du champ %s diffère

source: The present constructor %s has a conjunctive type
fr: Le présent constructeur %s a un type conjonctif

source: The present constructor %s has no type
fr: Le présent constructeur %s n'a pas de type

source: The private method %s cannot become public
fr: La méthode privée %s ne peut devenir publique

source: The record field %a is not mutable
fr: Le champ d'enregistrement %a n'est pas mutable

source: The record field %a@ belongs to the type
fr: Le champ d'enregistrement %a@ appartient au type

source: The record field label %s is defined several times
fr: L'étiquette %s du champ d'enregistrement est définie plusieurs fois

source: The signature for this packaged module couldn't be inferred.
fr: La signature de ce module empaqueté n'a pas pu être inférée.

source: The type %a in this module cannot be exported.@
fr: Le type %a dans ce module ne peut être exporté.@

source: The type %a@ is not a variant type
fr: Le type %a@ n'est pas un type de variant

source: The type abbreviation %s is cyclic
fr: Cette abréviation de type %s est cyclique

source: The type constraints are not consistent.@.
fr: Les contraintes de types ne sont pas consistantes.@.

source: The type constructor@ %a@ is not yet completely defined
fr: Le constructeur de type@ %a@ n'est pas encore complètement défini

source: The type of this packed module contains variables:@ %a
fr: Le type de ce module empaqueté contient des variables :@ %a

source: The type parameter
fr: Le paramètre de type

source: The type variable name %s is not allowed in programs
fr: Le nom de variable de type %s n'est pas autorisé

source: The types for field %s are not equal
fr: Les types pour le champ %s ne sont pas égaux

source: The value %s is not an instance variable
fr: La valeur %s n'est pas une variable d'instance

source: The variable %s on the left-hand side of this or-pattern has type
fr: La variable %s à gauche de ce motif alternatif a pour type

source: Their constraints differ
fr: Leurs contraintes diffèrent

source: Their internal representations differ:@ the first declaration uses unboxed float representation
fr: Leurs représentations internes diffèrent :@ la première déclaration utilise une représentation de flottants dépaquetée

source: Their internal representations differ:@ the first declaration uses unboxed representation
fr: Leurs représentations internes diffèrent :@ la première déclaration utilise une représentation dépaquetée

source: Their internal representations differ:@ the original definition uses unboxed float representation
fr: Leurs représentations internes diffèrent :@ la définition originelle utilise une représentation de flottants dépaquetée

source: Their internal representations differ:@ the original definition uses unboxed representation
fr: Leurs représentations internes diffèrent :@ la définition originelle utilise une représentation dépaquetée

source: Their internal representations differ:@ the second declaration uses unboxed float representation
fr: Leurs représentations internes diffèrent :@ la deuxième déclaration utilise une représentation de flottants dépaquetée

source: Their internal representations differ:@ the second declaration uses unboxed representation
fr: Leurs représentations internes diffèrent :@ la deuxième déclaration utilise une représentation dépaquetée

source: Their internal representations differ:@ the type definition uses unboxed float representation
fr: Leurs représentations internes diffèrent :@ la définition du type utilise une représentation de flottants dépaquetée

source: Their internal representations differ:@ this definition uses unboxed float representation
fr: Leurs représentations internes diffèrent :@ cette définition utilise une représentation de flottants dépaquetée

source: Their internal representations differ:@ this definition uses unboxed representation
fr: Leurs représentations internes diffèrent :@ cette définition utilise une représentation dépaquetée

source: Their internal representations differ:@ this extension definition uses unboxed float representation
fr: Leurs représentations internes diffèrent :@ cette définition étendue utilise une représentation de flottants dépaquetée

source: Their internal representations differ:@ this extension definition uses unboxed representation
fr: Leurs représentations internes diffèrent :@ cette définition étendue utilise une représentation dépaquetée

source: Their kinds differ
fr: Leurs natures diffèrent

source: Their variances do not agree
fr: Leurs variances ne sont pas compatibles

source: They have different arities
fr: Ils ont des arités différentes

source: This %s has type
fr: Ce %s a pour type

source: This '%s' might be unmatched
fr: Ce '%s' pourrait être désapparié

source: This `let module' expression has type@ %a.@ In this type, the locally bound module name %s escapes its scope
fr: Cette expression "let module" a pour type@ %a.@ Dans ce type, le nom de module local %s échappe de sa portée

source: This alias is bound to type
fr: Cet alias est associé au type

source: This argument cannot be applied with label %s
fr: Cet argument ne peut être appliqué avec l'étiquette %s

source: This argument cannot be applied without label
fr: Cet argument ne peut être appliqué sans étiquette

source: This class expression is not a class function, it cannot be applied
fr: Cette expression de classe n'est pas une fonction de classe, elle ne peut être appliquée

source: This class should be virtual
fr: Cette classe devrait être virtuelle

source: This class type should be virtual
fr: Ce type de classe devrait être virtuel

source: This constructor is not an extension constructor.
fr: Ce constructeur n'est pas un constructeur d'extension.

source: This expression cannot be coerced to type@;<1 2>%a;@ it has type
fr: Cette expression ne peut être coercée au type@;<1 2>%a;@ elle a pour type

source: This expression has no method %s
fr: Cette expression n'a pas de méthode %s

source: This expression has type
fr: Cette expression a pour type

source: This expression is not a packed module. It has type@ %a
fr: Cette expression n'est pas un module empaqueté. Elle a pour type@ %a

source: This expression is packed module, but the expected type is@ %a
fr: Cette expression est un module empaqueté, mais le type attendu est@ %a

source: This expression should not be a function,@ the expected type is@ %a
fr: Cette expression ne devrait pas être une fonction,@ le type attendu est@ %a

source: This fixed type %s
fr: Ce type fixé %s

source: This function expects too many arguments,@ it should have type@ %a
fr: Cette fonction attend trop d'arguments,@ elle devrait avoir pour type@ %a

source: This function is applied to arguments@ in an order different from other calls.@ This is only allowed when the real type is known.
fr: Cette fonction est appliquée à trop d'arguments@ dans un ordre différent des autres appels.@ Ce n'est autorisé que lorsque le véritable type est connu.

source: This is a generative functor. It can only be applied to ()
fr: Ceci est une foncteur génératif. Il ne peut être appliqué qu'à ()

source: This is an alias for module %a, which is missing
fr: Ceci est un alias pour le module %a, qui est manquant

source: This kind of expression is not allowed as right-hand side of `let rec'
fr: Cette sorte d'expression n'est pas autorisée à droite d'un `let rec'

source: This kind of recursive class expression is not allowed
fr: Cette sorte d'expression de classe récursive n'est pas autorisée

source: This module type is not a signature
fr: Ce type de module n'est pas une signature

source: This object duplication occurs outside a method definition
fr: Cette duplication d'objet se produit en-dehors d'une définition de méthode

source: This object has virtual %s
fr: Cet objet a une %s virtuelle

source: This object is expected to have type
fr: Cet objet est supposé avoir pour type

source: This pattern matches values of type
fr: Ce motif accepte des valeurs de type

source: This primitive declaration uses type %s, which is unannotated and unboxable. The representation of such types may change in future versions. You should annotate the declaration of %s with [@@boxed] or [@@unboxed].
fr: Cette déclaration de primitive utilise le type %s, qui n'est pas annoté et n'est dépaquetable. La représentation de tels types pourrait changer dans des versions futures. Vous devriez annoter la déclaration de %s avec [@@boxed] ou [@@unboxed].

source: This record expression is expected to have type
fr: Cette expression d'enregistrement est supposée avoir pour type

source: This record pattern is expected to have type
fr: Ce motif d'enregistrement est supposé avoir pour type

source: This type
fr: Ce type

source: This type constructor expands to type
fr: Ce constructeur de type tient lieu de

source: This type is recursive
fr: Ce type est récursif

source: This variant expression is expected to have type
fr: Mais le type de l'expression attendue était

source: This variant pattern is expected to have type
fr: Ce motif de variant est supposé avoir pour type

source: Too many [@@unboxed]/[@@untagged] attributes
fr: Trop d'attributs [@@unboxed]/[@@untagged]

source: Tuples must have at least 2 components.
fr: Les tuples doivent avoir au moins 2 composants.

source: Two constructors are named %s
fr: Deux constructeurs sont nommés %s

source: Two labels are named %s
fr: Deux étiquettes sont nommées %s

source: Two labels or constructors of the same name are defined in two mutually recursive types.
fr: Deux étiquettes ou constructeurs avec le même nom sont définis dans deux types mutuellement récursifs.

source: Type constraint on GADT type declaration
fr: Contrainte de type dans une déclaration de type GADT

source: Type constraints do not apply to GADT cases of variant types.
fr: Les contraintes de type ne s'appliquent pas aux sous-cas GADT des types variants.

source: Type declarations cannot be empty.
fr: Les déclarations de type ne peuvent être vides.
