Repository: Octachron/babilim
Catalog: translations/*.po
Languages: fr

source: Type declarations do not match
fr: Les déclarations de type ne sont pas compatibles

source: Type without principality.
fr: Type sans principalité.

source: Unbound class %a
fr: Classe non liée %a

source: Unbound class type %a
fr: Type de classe non lié %a

source: Unbound constructor %a
fr: Constructeur non lié %a

source: Unbound instance variable %s
fr: Variable d'instance non liée %s

source: Unbound module %a
fr: Module non lié %a

source: Unbound module type %a
fr: Type de module non lié %a

source: Unbound record field %a
fr: Champ d'enregistrement non lié %a

source: Unbound row variable in #%a
fr: Variable de rangée non liée dans #%a

source: Unbound type constructor %a
fr: Constructeur de type non lié %a

source: Unbound type parameter %s@.
fr: Paramètre de type non lié %s@.

source: Unbound value %a
fr: Valeur non liée %a

source: Unboxable type in primitive declaration
fr: Type non-empaquetable dans une déclaration de primitive

source: Undeclared virtual method.
fr: Méthode virtuelle non déclarée.

source: Unerasable optional argument.
fr: Argument optionnel non-effaçable.

source: Unescaped end-of-line in a string constant (non-portable code).
fr: Fin-de-ligne non échappée dans une chaîne de caractère constante (code non portable)

source: Unexpected documentation comment.
fr: Commentaire de documentation inattendu.

source: Unexpected existential
fr: Type existentiel inattendu

source: Uninterpreted extension '%s'.
fr: Extension non interprétée '%s'.

source: Unknown function
fr: Fonction inconnue

source: Unknown modifier '%c' for literal %s%c
fr: Modificateur inconnu '%c' pour la constante %s%c

source: Unreachable case in a pattern-matching (based on type information).
fr: Cas inatteignable dans un filtrage de motif (basé sur les informations de type).

source: Unused ancestor variable.
fr: Variable ancêtre inutilisée.

source: Unused constructor.
fr: Constructeur inutilisé.

source: Unused extension constructor.
fr: Constructeur d'extension inutilisé.

source: Unused for-loop index.
fr: Indice de boucle for inutilisé.

source: Unused function argument.
fr: Argument de fonction inutilisé.

source: Unused module declaration
fr: Définition de module inutilisée

source: Unused open statement.
fr: Ouverture de module inutilisée.

source: Unused rec flag.
fr: Marqueur "rec" inutilisé.

source: Unused type declaration.
fr: Définition de type inutilisée.

source: Unused value declaration.
fr: Définition de variable inutilisée.

source: Useless record "with" clause.
fr: Clause "with" inutile pour cet enregistrement.

source: Value declarations are only allowed in signatures
fr: Les déclarations de valeurs ne sont autorisées que dans les signatures

source: Variable %s is bound several times in this matching
fr: La variable %s apparaît plusieurs fois dans ce filtrage de motif

source: Variable %s must occur on both sides of this | pattern
fr: La variable %s doit apparaître des deux côtés du "|" dans ce motif

source: Variant types cannot be empty.
fr: Les types variants ne peuvent être vides.

source: Warning
fr: Avertissement

source: Warning on non-tail calls if @tailcall present.
fr: Avertissement sur les appels non-tail si @tailcall est présent.

source: Wildcard pattern given as argument to a constant constructor.
fr: Motif joker donné comme argument à un constructeur constant.

source: [@inlined] attribute was not used on this function application (the optimizer did not know what function was being applied)
fr: L'attribut [@inlined] n'a pas été utilisé dans cette application de fonction (l'optimiseur ne savait pas que la fonction était appliquée)

source: [@inlined] attributes may not be used on partial applications
fr: Les attributs [@inlined] pourraient ne pas être utilisés dans les applications partielles

source: [@specialised] attributes may not be used on partial applications
fr: Les attributs [@specialised] pourraient ne pas être utilisés dans les applications partielles

source: [@unroll] attribute was not used on this function application (the optimizer did not know what function was being applied)
fr: L'attribut [@unroll] n'a pas été utilisé dans cette application de fonction (l'optimiseur ne savait pas que la fonction était appliquée)

source: [@unroll] attributes may not be used on partial applications
fr: Les attributs [@unroll] pourraient ne pas être utilisés dans les applications partielles

source: all the fields are explicitly listed in this record: the 'with' clause is useless.
fr: tous les champs sont listés explicitement dans cet enregistrement : la clause 'with" est inutile.

source: ambiguous documentation comment
fr: commentaire de documentation ambigu

source: bad source file name: "%s" is not a valid module name.
fr: nom de module problématique : le nom du fichier source "%s" n'est pas un nom de module OCaml valide.

source: broken invariant in parsetree: %a
fr: invariant brisé dans le parsetree: %a

source: but a constructor was expected belonging to the variant type
fr: mais un constructeur était attendu, qui aurait dû appartenir au type de variant

source: but a field was expected belonging to the record type
fr: mais un champ était attendu, qui aurait dû appartenir au type enregistrement

source: but a pattern was expected which matches values of type
fr: mais un motif était attendu, celui-ci aurait dû être compatible avec des valeurs de type

source: but actually has type
fr: mais son véritable type est

source: but an expression was expected of type
fr: mais le type de l'expression attendue était

source: but is expected to have type
fr: mais le type attendu était

source: but is here used with type
fr: mais le type utilisé ici est

source: but is mixed here with fields of type
fr: mais il est mélangé avec des champs du type

source: but is used as an instance of type
fr: mais il est utilisé comme une instance du type

source: but is used here with type
fr: mais le type utilisé ici est

source: but is used with type
fr: mais le type utilisé est

source: but its first argument is labelled %s
fr: mais son premier argument est étiqueté %s

source: but its first argument is not labelled
fr: mais son premier argument n'est pas étiqueté

source: but on the right-hand side it has type
fr: mais à droite, son type est

source: but was expected to be of type
fr: mais le type attendu était

source: commuted an argument
fr: argument échangé

source: commuting this argument
fr: échanger cet argument

source: constructor %s is never used to build values. (However, this constructor appears in patterns.)
fr: le constructeur %s n'est jamais utilisé pour construire des valeurs. (Cependant, ce constructeur apparaît dans des motifs.)

source: constructor %s is never used to build values. Its type is exported as a private type.
fr: le constructeur %s n'est jamais utilisé pour construire des valeurs. Son type est exporté comme un type privé.

source: deprecated: %s
fr: déprécié: %s

source: does not meet its constraint: it should be
fr: ne vérifie pas ses contraintes: il devrait être

source: eliminated optional argument
fr: argument optionnel éliminé

source: exception %s is never used to build values.
fr: l'exception %s n'est jamais utilisée pour construire des valeurs.

source: expected tailcall
fr: tailcall attendu

source: extensible variant types cannot be unboxed
fr: les type variants extensibles ne peuvent être dépaquetés

source: extension constructor %s is never used to build values.
fr: le constructeur d'extension %s n'est jamais utilisé pour construire des valeurs.

source: files %s and %s both define a module named %s
fr: les fichiers %s et %s définissent tous les deux un module nommé %s

source: illegal backslash escape in string.
fr: barre oblique inversée illégale dans une chaîne de caractère.

source: illegal environment variable %s : %s
fr: variable d'environnement illégale %s : %s

source: illegal payload for attribute '%s'. %s
fr: charge illégale pour l'attribut '%s'. %s

source: implicit elimination of optional argument %s
fr: élimination implicite de l'argument optionnel %s

source: injective
fr: injectif

source: injective contravariant
fr: injectif contravariant

source: injective covariant
fr: injectif covariant

source: injective invariant
fr: injectif invariant

source: invalid package type: %s
fr: type de module empaqueté invalide: %s

source: is not a subtype of
fr: n'est pas un sous-type de

source: is not compatible with type
fr: n'est pas compatible avec le type

source: is not included in
fr: n'est pas inclus dans

source: it has more than one constructor
fr: il a plus qu'un constructeur

source: it has more than one field
fr: il a plus qu'un champ

source: it is abstract
fr: il est abstrait

source: it is mutable
fr: il est mutable

source: its constructor has more than one argument
fr: son constructeur a plus d'un argument

source: its constructor has no argument
fr: son constructeur n'a pas d'argument

source: label %s was omitted in the application of this function.
fr: l'étiquette %s a été omise dans l'application de cette fonction.

source: mutating field %s
fr: affecter le champ %s

source: no cmi file was found in path for module %s
fr: aucun fichier cmi trouvé pour le module %s

source: no cmx file was found in path for module %s, and its interface was not compiled with -opaque
fr: aucun ficher cmx trouvé pour le module %s, et son interface n'a pas été compilée avec -opaque

source: no valid cmi file was found in path for module %s. %s
fr: aucun fichier cmi valide n'a été trouvé pour le module %s. %s

source: should be an instance of type
fr: devrait être une instance du type

source: the %S attribute cannot appear in this context
fr: l'attribut "%S" ne peut apparaître dans ce contexte

source: the %S attribute is used more than once on this expression
fr: l'attribut %S a été utilisé plus d'une fois dans cette expression

source: the constructor %s is defined in both types %s and %s.
fr: le constructeur %s est défini à la fois dans %s et %s.

source: the first is not an immediate type
fr: le premier n'est pas un type immédiat

source: the following instance variables are overridden by the class %s The behaviour changed in ocaml 3.10 (previous behaviour was hiding.)
fr: les variables d'instance suivantes sont réécrites par la classe %s Ce comportement a changé depuis OCaml 3.10 (le comportement précédent était de cacher ces variables)

source: the following labels are not bound in this record pattern: %s Either bind these labels explicitly or add '; _' to the pattern.
fr: les étiquettes suivantes ne sont pas liées dans ce motif d'enregistrement: %s Liez explicitement ces étiquettes ou bien ajoutez '; _' à ce motif.

source: the following methods are overridden by the class %s
fr: les méthodes suivantes sont réécrites par la classe %s

source: the following private methods were made public implicitly: %s.
fr: les méthodes privées suivantes ont été rendues publiques implicitement: %s.

source: the instance variable %s is overridden. The behaviour changed in ocaml 3.10 (previous behaviour was hiding.)
fr: la variable d'instance %s a été réécrite. Ce comportement a changé depuis OCaml 3.10 (le comportement précédent était de cacher ces variables.)

source: the label %s is defined in both types %s and %s.
fr: l'étiquette %s est définie à la fois dans %s et %s.

source: the label %s is not optional.
fr: l'étiquette %s n'est pas optionnelle.

source: the method %s is overridden.
fr: la méthode %s est réécrite.

source: the original is not an immediate type
fr: l'original n'est pas un type immédiat

source: the type is not an immediate type
fr: le type n'est pas un type immédiat

source: the virtual method %s is not declared.
fr: la méthode virtuelle %s n'est pas déclarée.

source: these field labels belong to several types: %s The first one was selected. Please disambiguate if this is wrong.
fr: ces étiquettes de champs appartiennent à plusieurs types: %s . Le premier a été sélectionné. Veuillez ajouter une annotation de type si ce choix est erroné.

source: this `(*' is the start of a comment. Hint: Did you forget spaces when writing the infix operator `( * )'?
fr: ce `(*' est le début d'un commentaire. Suggestion: Auriez-vous oublié des espaces en écrivant l'opérateur infixe `( * )`?

source: this argument will not be used by the function.
fr: cet argument ne sera pas utilisé par la fonction.

source: this coercion to format6
fr: cette coercition vers format6

source: this expression should have type unit.
fr: cette expression devrait avoir pour type unit.

source: this function application is partial, maybe some arguments are missing.
fr: cette application de fonction est partielle, certains arguments sont peut-être manquants.

source: this ground coercion
fr: cette coercition de base

source: this is not the end of a comment.
fr: ceci n'est pas la fin d'un commentaire.

source: this match case is unreachable. Consider replacing it with a refutation case '<pat> -> .'
fr: ce cas dans le filtrage est inatteignable. Vous pouvez le remplacer par un cas réfutable '<pat> -> .'

source: this match case is unused.
fr: ce cas de filtrage est inutilisé.

source: this module packing
fr: cet emballage de module

source: this module unpacking
fr: ce déballage de module

source: this open statement shadows the class identifier %s (which is later used)
fr: cette ouverture de module dissimule l'identifiant de classe %s (qui est utilisé plus tard)

source: this open statement shadows the constructor %s (which is later used)
fr: cette ouverture de module dissimule le constructeur %s (qui est utilisé plus tard)

source: this open statement shadows the label %s (which is later used)
fr: cette ouverture de module dissimule l'étiquette %s (qui est utilisée plus tard)

source: this open statement shadows the module identifier %s (which is later used)
fr: cette ouverture de module dissimule l'identifiant de module %s (qui est utilisé plus tard)

source: this open statement shadows the module type identifier %s (which is later used)
fr: cette ouverture de module dissimule l'identifiant du type %s (qui est utilisé plus tard)

source: this open statement shadows the type identifier %s (which is later used)
fr: cette ouverture de module dissimule l'identifiant du type %s (qui est utilisé plus tard)

source: this open statement shadows the value identifier %s (which is later used)
fr: cette ouverture de module dissimule l'identifiant de la valeur %s (qui est utilisé plus tard)

source: this optional argument cannot be erased.
fr: cet argument optionnel ne peut être effacé.

source: this pattern-matching is fragile.
fr: ce filtrage de motif est fragile.

source: this pattern-matching is fragile. It will remain exhaustive when constructors are added to type %s.
fr: ce filtrage de motif est fragile. Il restera exhaustif lorsque des constructeurs sont ajoutés au type %s.

source: this pattern-matching is not exhaustive.
fr: ce filtrage de motif n'est pas exhaustif.

source: this pattern-matching is not exhaustive. All clauses in this pattern-matching are guarded.
fr: ce filtrage de motif n'est pas exhaustif. Toutes les clauses du filtrage sont gardées.

source: this pattern-matching is not exhaustive. Here is an example of a case that is not matched: %s
fr: ce filtrage de motif n'est pas exhaustif. Voici un exemple de cas qui n'est pas filtré : %s

source: this record of type %s contains fields that are not visible in the current scope: %s. They will not be selected if the type becomes unknown.
fr: cet enregistrement de type %s contient des champs qui ne sont pas visibles dans la portée courante : %s Ils ne seront pas sélectionnés si le type devient inconnu.

source: this statement never returns (or has an unsound type.)
fr: cette phrase ne retourne jamais (ou a un type insensé.)

source: this sub-pattern is unused.
fr: ce sous-motif est inutilisé.

source: this type-based constructor disambiguation
fr: cette désambiguïsation de constructeur fondée sur le type

source: this type-based field disambiguation
fr: cette désambiguïsation de champ fondée sur le type

source: this type-based record disambiguation
fr: cette désambiguïsation de record fondée sur le type

source: this use of %s relies on type-directed disambiguation, it will not compile with OCaml 4.00 or earlier.
fr: cet usage de %s repose sur la désambiguïsation dirigée par le type, il n'est pas compilable avec une version d'OCaml plus ancienne que 4.00.

source: this use of a polymorphic method
fr: cet usage de méthode polymorphique

source: unattached documentation comment (ignored)
fr: commentaire documentation non-attaché (et ignoré)

source: unescaped end-of-line in a string constant (non-portable code)
fr: fin-de-ligne non échappée dans une chaîne de caractère constante (code non portable)

source: unrestricted
fr: non-restreint

source: unused ancestor variable %s.
fr: variable ancêtre %s inutilisée.

source: unused constructor %s.
fr: constructeur %s inutilisé.

source: unused exception %s
fr: exception %s inutilisée

source: unused extension constructor %s
fr: constructeur d'extension %s inutilisé

source: unused for-loop index %s.
fr: indice de boucle %s for inutilisé.

source: unused module %s.
fr: module %s inutilisé.

source: unused open %s.
fr: ouverture de module %s inutilisée.

source: unused rec flag.
fr: marqueur "rec" inutilisé.

source: unused type %s.
fr: type %s inutilisé.

source: unused value %s.
fr: valeur %s inutilisée.

source: unused variable %s.
fr: variable %s inutilisée.

source: using an optional argument here
fr: utilisant un argument optionnel ici

source: warning
fr: avertissement

source: which is less general than
fr: qui est moins général que

source: wildcard pattern given as argument to a constant constructor
fr: motif joker donné en tant qu'argument d'un constructeur constant

source: with
fr: avec

source: with label %s
fr: avec l'étiquette %s

source: without label
fr: sans étiquette
