Repository: Octachron/babilim
Catalog: translations/*.po
Languages: fr

source: %c Alias for warning %i.
fr: %c Alias pour l'avertissement %i.

source: %c warnings %s.
fr: %c avertissements %s.

source: A all warnings@.
fr: A tous les avertissements@.

source: ", line
fr: ", ligne

source: %a (However, this constructor appears in patterns.)
fr: %a (Cependant, ce constructeur apparaît dans des motifs.)

source: %a It is exported or rebound as a private extension.
fr: %a Il est exporté ou redéfini comme une extension privée.

source: %a is not principal.
fr: %a n'est pas principal.

source: %a without principality.
fr: %a sans principalité.

source: %s belongs to several types: %s The first one was selected. Please disambiguate if this is wrong.
fr: %s appartient à plusieurs types : %s Le premier a été sélectionné. Veuillez expliciter le type si ce choix est erroné.

source: %s was selected from type %s. It is not visible in the current scope, and will not be selected if the type becomes unknown.
fr: %s a été sélectionné à partir du type %s. Celui-ci n'est pas visible dans la portée actuelle, et ne sera pas sélectionné si le type devient inconnu.

source: , characters
fr: , caractères

source: .@.@[<hov2>In case %s of@ %a@;<1 -2> the variable %a is unbound@]
fr: .@.@[<hov2>Dans le cas %s of@ %a@;<1 -2>la variable %a n'est pas liée@]

source: .@.@[<hov2>In case `%s of@ %a@;<1 -2> the variable %a is unbound@]
fr: .@.@[<hov2>Dans le cas `%s of@ %a@;<1 -2>la variable %a n'est pas liée@]

source: .@.@[<hov2>In field %s:@ %a@;<1 -2>the variable %a is unbound@]
fr: .@.@[<hov2>Dans le champ %s :@ %a@;<1 -2>la variable %a n'est pas liée@]

source: .@.@[<hov2>In method %s:@ %a@;<1 -2> the variable %a is unbound@]
fr: .@.@[<hov2> Dans la méthode %s :@ %a@;<1 -2>la variable %a n'est pas liée@]

source: .@.@[<hov2>In type@ %a@;<1 -2>the variable %a is unbound@]
fr: .@.@[<hov2>Dans le type@ %a@;<1 -2>la variable %a n'est pas liée@]

source: <here>
fr: <ici>

source: @ @[It is applied to too many arguments;@ maybe you forgot a ';'@]@]
fr: @ @[Elle est appliquée à trop d'arguments;@ vous avez peut-être oublié un ';'@]@]

source: @,@[%a is abstract because no corresponding cmi file was found in path.@]
fr: @,@[%a est abstrait parce qu'aucun fichier cmi correspondant n'a été trouvé.@]

source: @,@[<hov>The type variable %a occurs inside@ %a@]
fr: @,@[<hov>Cette variable de type %a apparaît à l'intérieur de@ %a@]

source: @,@[<hov>This instance of %a is ambiguous:@ it would escape the scope of its equation@]
fr: @,@[<hov>Cette instance de %a est ambiguë :@ elle échapperait à la portée de son équation@]

source: @,@[Hint: Did you forget to provide `()' as argument?@]
fr: @,@[Suggestion : Avez-vous oublié de fournir `()' comme argument ?@]

source: @,@[Hint: Did you forget to wrap the expression using `fun () ->'?@]
fr: @,@[Suggestion : Avez-vous oublié d'enclore cette expression par `fun () ->' ?@]

source: @,@[The %s object type has an abstract row, it cannot be closed@]
fr: @,@[Ce type d'objet %s a un type de rangée abstraite, il ne peut pas être fermé@]

source: @,@[The first object type has no method %s@]
fr: @,@[Le premier type objet n'a pas de méthode %s@]

source: @,@[The first variant type does not allow tag(s)@ @[<hov>%a@]@]
fr: @,@[Le type du premier variant n'autorise pas le(s) tag(s)@ @[<hov>%a@]@]

source: @,@[The second object type has no method %s@]
fr: @,@[Le second type objet n'a pas de méthode %s@]

source: @,@[The second variant type does not allow tag(s)@ @[<hov>%a@]@]
fr: @,@[Le type du second variant n'autorise pas le(s) tag(s)@ @[<hov>%a@]@]

source: @,@[The type constructor@;<1 2>%a@ would escape its scope@]
fr: @,@[Le constructeur de type @;<1 2>%a@ échapperait de sa portée@]

source: @,Self type cannot be unified with a closed object type
fr: @, Le type réfléchi, Self, ne peut pas être unifié avec un type objet fermé

source: @,Self type cannot escape its class
fr: @,Le type réfléchi, Self, ne peut pas s'échapper en dehors de sa classe

source: @,The universal variable %a would escape its scope
fr: @,La variable universelle %a échapperait de sa portée

source: @,These two variant types have no intersection
fr: @,Ces deux types de variants n'ont pas d'intersection

source: @,Types for method %s are incompatible
fr: @,Les types pour la méthode %s sont incompatibles

source: @,Types for tag `%s are incompatible
fr: @,Les types pour le tag %s sont incompatibles

source: @[%a has the wrong type for a printing function.@]@.
fr: @[%a a le mauvais type pour une fonction d'affichage.@]@.

source: @[%a is not currently active as a printing function.@]@.
fr: @[%a n'est pas active en tant que fonction d'affichage en ce moment.@]@.

source: @[%t.@ @[<2>The following %s are undefined :%a@]@]
fr: @[%t.@ @[<2>Les %s suivants sont indéfinis :%a@]@]

source: @[<hov>Method '%s' has type %a,@ which should be %a@]
fr: @[<hov> La méthode '%s' a pour type %a,@ lequel devrait être %a@]

source: @[<hov>Some record fields are undefined:%a@]
fr: @[<hov>Certains champs du record ne sont pas définis : %a@]

source: @[<hov>The universal type variable '%s cannot be generalized:@ %a.@]
fr: @[<hov>La variable de type universel '%s ne peut pas être généralisée :@ %a.@]

source: @[<hov>This variant type contains a constructor@ %a@ which should be %a@]
fr: @[<hov> Ce type variant contient un constructeur@ %a@ qui devrait être %a@]

source: @[<hv 2>At position@ %a@]@
fr: @[<hv 2>À l'emplacement@ %a@]@

source: @[<hv 2>Class declarations do not match:@ %a@;<1 -2>does not match@ %a@]@ %a
fr: @[<hv 2>Les déclarations de classes ne sont pas assorties :@ %a@;<1 -2>n'est pas compatible avec@ %a@]@ %a

source: @[<hv 2>Class type declarations do not match:@ %a@;<1 -2>does not match@ %a@]@ %a
fr: @[<hv 2>Les déclarations de types de classes ne sont pas assorties :@ %a@;<1 -2>n'est pas compatible avec@ %a@]@ %a

source: @[<hv 2>Extension declarations do not match:@ %a@;<1 -2>is not included in@ %a@]
fr: @[<hv 2>Les déclarations d'extensions ne sont pas assorties :@ %a@;<1 -2>n'est pas inclus dans@ %a@]

source: @[<hv 2>Module type declarations do not match:@ %a@;<1 -2>does not match@ %a@]
fr: @[<hv 2>Les déclarations de types de modules ne sont pas assorties :@ %a@;<1 -2>n'est pas compatible avec@ %a@]

source: @[<hv 2>Modules do not match:@ %a@;<1 -2>is not included in@ %a@]
fr: @[<hv 2>Les modules ne sont pas assortis :@ %a@;<1 -2>n'est pas inclus dans@ %a@]

source: @[<hv 2>Values do not match:@ %a@;<1 -2>is not included in@ %a@]
fr: @[<hv 2>Les valeurs ne sont pas assorties :@ %a@;<1 -2>n'est pas inclus dans@ %a@]

source: @[<hv>An external function with more than 5 arguments requires a second stub function@ for native-code compilation@]
fr: @[<hv>Une fonction externe avec plus de 5 arguments requiert une seconde fonction d'échafaudage@ pour la compilation en code natif@]

source: @[<hv>In the definition of %s, type@ %a@ should be@ %a@]
fr: @[<hv>Dans la définition de %s, le type@ %a@ devrait être@ %a@]

source: @[<v>@[<2>The function applied to this argument has type@ %a@]@.This argument cannot be applied %a@]
fr: @[<v>@[<2>La fonction appliquée à cet argument a pour type@ %a@]@.Cet argument ne peut pas être appliqué %a@]

source: @[<v>@[<2>This expression has type@ %a@]@ %a@]
fr: @[<v>@[<2>Cette expression a pour type@ %a@]@ %a@]

source: @[<v>@[<2>This function has type@ %a@]
fr: @[<v>@[<2>Cette fonction a pour type@ %a@]

source: @[<v>@[<2>This function should have type@ %a@]@,%a@]
fr: @[<v>@[<2>Cette fonction devrait avoir pour type@ %a@]@,%a@]

source: @[<v>@[<hov>This extension@ does not match the definition of type %s@]%a@]
fr: @[<v>@[<hov>Cette extension@ n'est pas compatible avec la définition du type %s@]%a@]

source: @[<v>@[<hov>This variant or record definition@ does not match that of type@;<1 2>%a@]%a@]
fr: @[<v>@[<hov>Cette définition de type variant ou enregistrement@ n'est pas compatible avec celle du type@;<1 2>%a@]%a@]

source: @[<v>@[In this `with' constraint, the new definition of %a@ does not match its original definition@ in the constrained signature:@]@ %a@]
fr: @[<v>@[À l'intérieur de la contrainte `with', la nouvelle définition de %a@ n'est pas compatible avec la définition originelle@ dans la contrainte de signature :@]@ %a@]

source: @[<v>@[Self type should not occur in the non-generic type@;<1 2>%a@]@,It would escape the scope of its class@]
fr: @[<v>@[Le type réfléchi, Self, ne devrait pas apparaître dans le type non-générique @;<1 2>%a@]@,Il s'échapperait de la portée de sa classe@]

source: @[<v>@[Some type variables are unbound in this type:@;<1 2>%t@]@ @[%a@]@]
fr: @[<v>@[Des variables de type ne sont pas liées dans ce type :@;<1 2>%t@]@ @[%a@]@]

source: @[<v>@[This expression has type@;<1 2>%a@]@,It has no method %s@]
fr: @[<v>@[Cette expression a pour type@;<1 2>%a@]@, Celui-ci n'a pas de méthode %s@]

source: @[<v>Signature mismatch:@ %a@]
fr: @[<v>Incompatibilité de signature :@ %a@]

source: @[<v>The definition of %s contains a cycle:@ %a@]
fr: @[<v>Cette définition de %s contient un cycle :@ %a@]

source: @[A type cannot be boxed and unboxed at the same time.@]
fr: @[Un type ne peut pas être simultanément empaqueté et dépaqueté.@]

source: @[Cannot extend private type definition@ %a@]
fr: @[Cette définition de type privé ne peut pas être étendue@ %a@]

source: @[Constraints are not satisfied in this type.@ @[<hv>Type@ %a@ should be an instance of@ %a@]@]
fr: @[Les contraintes ne sont pas vérifiées dans ce type.@ @[<hv>Le type@ %a@ devrait être un sous-cas de@ %a@]@]

source: @[Could not find the .cmi file for interface@ %a.@]
fr: @[Impossible de trouver le fichier .cmi pour l'interface@ %a.@]

source: @[Error during code loading: %s@]@.
fr: @[Erreur durant le chargement du code : %s@]@.

source: @[Exception patterns must be at the top level of a match case.@]
fr: @[Les motifs d'exception doivent être placés au premier niveau des cas filtrés par match.@]

source: @[GADT case syntax cannot be used in a 'nonrec' block.@]
fr: @[ La syntaxe GADT ne peut pas être utilisée au sein d'un bloc non récursif introduit par 'nonrec' .@]

source: @[Ill-typed functor application %a(%a)@]
fr: @[Application de foncteur mal-typée %a(%a)@]

source: @[In this GADT definition,@ the variance of some parameter@ cannot be checked@]
fr: @[Dans cette définition de GADT,@ la variance de certains paramètres@ n'a pas pu être validée@]

source: @[In this definition, a type variable cannot be deduced@ from the type parameters.@]
fr: @[Dans cette définition, une variable de type n'a pas pu être déduite@ à partir des types en paramètres.@]

source: @[In this definition, a type variable has a variance that@ cannot be deduced from the type parameters.@ %t@]
fr: @[Dans cette définition, une variable de type a une variance qui@ ne peut pas être déduite à partir des types en paramètres.@ %t@]

source: @[In this definition, a type variable has a variance that@ is not reflected by its occurrence in type parameters.@ %t@]
fr: @[Dans cette définition, une variable de type a une variance qui@ n'est pas reflétée par ses apparitions parmi les paramètres de type.@ %t@]

source: @[In this definition, expected parameter variances are not satisfied.@ The %dst type parameter was expected to be %a,@ but it is %a.@]
fr: @[Dans cette définition, les variances attendues des paramètres ne sont pas correctes.@ Le premier paramètre de type était supposé être %2$a,@ mais il est en fait %3$a.@]

source: @[Invalid for-loop index: only variables and _ are allowed.@]
fr: @[Boucle for invalide : seule des variables et _ sont permises.@]

source: @[Multiple definition of the %s name %s.@ Names must be unique in a given structure or signature.@]
fr: @[Multiples définitions du nom de %s, %s, .@ Les noms doivent être uniques au sein d'une structure ou signature.@]

source: @[Only character intervals are supported in patterns.@]
fr: @[Seuls les intervalles de caractères sont supportés dans les motifs.@]

source: @[The GADT constructor %s of type %a@ must be qualified in this pattern.@]
fr: @[Le constructeur %s du type GADT %a@ doit être qualifié dans ce motif.@]

source: @[The abbreviation %a@ is used with parameters@ %a@ which are incompatible with constraints@ %a@]
fr: @[L'abréviation %a@ est utilisée avec des paramètres@ %a@ qui ne sont pas compatibles avec les contraintes@ %a@]

source: @[The abbreviation@ %a@ expands to type@ %a@ but is used with type@ %a@]
fr: @[L'abréviation@ %a@ tient lieu du type@ %a@ mais est utilisée avec le type@ %a@]

source: @[The class constructor %a@ expects %i type argument(s),@ but is here applied to %i type argument(s)@]
fr: @[Le constructeur de classe %a@ attend %i argument(s) de type,@ mais il est appliqué à %i argument(s) de type@]

source: @[The class type@ %a@ is not yet completely defined@]
fr: @[Le type de classe@ %a@ n'est pas encore complètement défini@]

source: @[The class type@;<1 2>%a@ is not matched by the class type@;<1 2>%a@]
fr: @[Le type de classe@;<1 2>%a@ n'est pas assorti au type de classe@;<1 2>%a@]

source: @[The class@ %a@ is not yet completely defined@]
fr: @[La classe@ %a@ n'est pas encore complètement définie@]

source: @[The constructor %a extends type %s whose declarations dos not match the declaration of type %s@]
fr: @[Le constructeur %a étend le type %s dont la déclaration n'est pas assortie à celle du type %s@]

source: @[The constructor %a@ expects %i argument(s),@ but is applied here to %i argument(s)@]
fr: @[Le constructeur %a@ attend %i argument(s),@ mais il est appliqué à %i argument(s)@]

source: @[The constructor@ %a@ is private@]
fr: @[Le constructeur@ %a@ est privé@]

source: @[The debugger does not contain the code for@ %a.@ Please load an implementation of %s first.@]@.
fr: @[Le dévermineur ne contient pas le code pour@ %a.@ Veuillez charger d'abord une implémentation de %s.@]@.

source: @[The field %s is not part of the record argument for the %a constructor@]
fr: @[Le champ %s ne fait pas parti de l'enregistrement en argument du constructeur %a@]

source: @[The first class type has no instance variable %s@]
fr: @[Le premier type de classe n'a pas de variable d'instance %s@]

source: @[The first class type has no method %s@]
fr: @[Le premier type de classe n'a pas de méthode %s@]

source: @[The functor %a is generative,@ it@ cannot@ be@ applied@ in@ type@ expressions@]
fr: @[Le foncteur %a est génératif,@ il@ ne@ peut@ être@ appliqué@ dans@ des@ expressions@ de@ type@]

source: @[The implementation %s@ does not match the interface %s:
fr: @[L'implémentation %s@ n'est pas compatible avec l'interface %s :

source: @[The instance variable `%s'@ has multiple definitions in this object@]
fr: @[La variable d'instance `%s'@ a plusieurs définitions dans cet objet@]

source: @[The instance variable `%s'@ has no previous definition@]
fr: @[La variable d'instance `%s'@ n'a pas de définition préalable@]

source: @[The instance variable is %a;@ it cannot be redefined as %a@]
fr: @[La variable d'instance est %a;@ elle ne peut pas être redéfinie comme %a@]

source: @[The interface %a@ declares values, not just types.@ An implementation must be provided.@]
fr: @[L' interface %a@ déclare des valeurs et non pas uniquement des types.@ Une implémentation doit être fournie.@]

source: @[The method `%s'@ has multiple definitions in this object@]
fr: @[La méthode `%s'@ a plusieurs définitions dans cet objet@]

source: @[The method `%s'@ has no previous definition@]
fr: @[La méthode `%s'@ n'a pas de définition préalable@]

source: @[The module %a is a functor, it cannot have any components@]
fr: @[Le module %a est un foncteur, il ne peut pas avoir de composants@]

source: @[The module %a is a structure, it cannot be applied@]
fr: @[Le module %a est une structure, il ne peut pas être appliqué@]

source: @[The module %a is abstract, it cannot be applied@]
fr: @[Le module %a est abstrait, il ne peut pas être appliqué@]

source: @[The module %a is abstract, it cannot have any components@]
fr: @[Le module %a est abstrait, il ne peut pas avoir de composants@]

source: @[The non-mutable instance variable %s cannot become mutable@]
fr: @[La variable d'instance immutable %s ne peut devenir mutable@]

source: @[The public method %s cannot be hidden@]
fr: @[La méthode publique %s ne peut être cachée@]

source: @[The public method %s cannot become private
fr: @[La méthode publique %s ne peut devenir privée@]

source: @[The record field %a is polymorphic.@ %a@]
fr: @[Le champ %a de l'enregistrement est polymorphique.@ %a@]

source: @[The signature constrained by `with' has no component named %a@]
fr: @[La signature contrainte par `with' n'a pas de composant nommé %a@]

source: @[The type %a@ does not expand to a polymorphic variant type@]
fr: @[Le type %a@ ne tient pas lieu de type de variant polymorphe@]

source: @[The type %a@ is not an object type@]
fr: @[Le type %a@ n'est pas un type objet@]

source: @[The type constructor %a@ expects %i argument(s),@ but is here applied to %i argument(s)@]
fr: @[Le constructeur de type %a@ attend %i argument(s),@ mais il est appliqué à %i argument(s)@]

source: @[The type of %a does not match %a's parameter@ %a@]
fr: @[Le type de %a@ n'est pas compatible avec le type du paramètre %a@ %a@]

source: @[The type of self cannot be coerced to@ the type of the current class:@ %a.@.Some occurrences are contravariant@]
fr: @[Le type-même de l'objet ne peut pas être coercé@ au type de la classe actuelle :@ %a.@.Certaines apparitions sont contravariantes@]

source: @[The type of this class,@ %a,@ contains non-collapsible conjunctive types in constraints@]
fr: @[Le type de cette classe,@ %a,@ contient des types conjonctif non effaçables dans ses contraintes@]

source: @[The type of this class,@ %a,@ contains type variables that cannot be generalized@]
fr: @[Le type de cette classe,@ %a,@ contient des variables de type qui ne peuvent être généralisées@]

source: @[The type of this expression,@ %a,@ contains type variables that cannot be generalized@]
fr: @[Le type de cette expression,@ %a,@ contient des variables de type qui ne peuvent être généralisées@]

source: @[The type of this module,@ %a,@ contains type variables that cannot be generalized@]
fr: @[Le type de ce module,@ %a,@ contient des variables de type qui ne peuvent être généralisées@]

source: @[The virtual %s %s cannot be hidden@]
fr: @[La %s virtuelle %s ne peut être cachée@]

source: @[The virtual instance variable %s cannot become concrete@]
fr: @[La variable d'instance virtuelle %s ne peut devenir concrète@]

source: @[The virtual method %s cannot become concrete
fr: @[La méthode virtuelle %s ne peut devenir concrète@]

source: @[This class expression is not a class structure; it has type@ %a@]
fr: @[Cette expression de classe n'est pas une structure de classe; elle a pour type@ %a@]

source: @[This constructor expects an inlined record argument.@]
fr: @[Ce constructeur attend comme argument un enregistrement incorporé.@]

source: @[This expression creates fresh types.@ %s@]
fr: @[Cette expression crée des types frais.@ %s@]

source: @[This form is not allowed as the type of the inlined record could escape.@]
fr: @[Cette forme n'est pas autorisée car elle permettrait au type enregistrement incorporé de s'échapper.@]

source: @[This functor has type@ %a@ The parameter cannot be eliminated in the result type.@ Please bind the argument to a module identifier.@]
fr: @[Ce foncteur a pour type@ %a@ Le paramètre ne peut être éliminé au sein du type résultant.@ Veuillez lier cet argument à un identifiant de module.@]

source: @[This inheritance does not override any method@ instance variable@]
fr: @[Cet héritage n'écrase aucune méthode@ ou variable d'instance@]

source: @[This match case could not be refuted.@ Here is an example of a value that would reach it:@ %a@]
fr: @[Ce cas de filtrage n'a pu être réfuté.@ Voici un exemple d'une valeur qui l'atteint :@ %a@]

source: @[This module is not a functor; it has type@ %a@]
fr: @[Ce module n'est pas un foncteur, il a pour type@ %a@]

source: @[This module is not a structure; it has type@ %a
fr: @[Ce module n'est pas une structure, il a pour type@ %a

source: @[This pattern cannot match self: it only matches values of type@ %a@]
fr: @[Ce motif ne peut pas filtrer le type de l'objet-même : il n'est compatible qu'avec des valeurs de type@ %a@]

source: @[This type cannot be unboxed because@ %a.@]
fr: @[Ce type ne peut pas être dépaqueté parce que@ %a.@]

source: @[This type cannot be unboxed because@ it might contain both float and non-float values.@ You should annotate it with [%@%@ocaml.boxed].@]
fr: @[Ce type ne peut être dépaqueté parce qu'@ il pourrait contenir à la fois des valeurs de type flottants et non-flottants.@ Vous devriez l'annoter avec [%@%@ocaml.boxed].@]

source: @[Too many non-constant constructors@ -- maximum is %i non-constant constructors@]
fr: @[Trop de constructeurs non-constants@ -- le maximum est %i constructeurs non-constants@]

source: @[Type@;<1 2>%a@ %t@;<1 2>%a@] %a
fr: @[Le type@;<1 2>%a@ %t@;<1 2>%a@] %a

source: @[Types marked with the immediate attribute must be@ non-pointer types like int or bool@]
fr: @[Les types marqués avec l'attribut immédiat ne doivent pas être@ des types de pointeur, par exemple int ou bool@]

source: @[Unbound identifier %a@]@.
fr: @[Identifiant non lié %a@]@.

source: @[Unbound value %a.@ %a %i.@]
fr: @[Valeur non liée %a.@ %a %i.@]

source: @[Variant tags `%s@ and `%s have the same hash value.@ Change one of them.@]
fr: @[Les noms des variants `%s@ et `%s partagent la même valeur de hash.@ Changez l'un d'entre eux.@]

source: @[`%s'@ has no previous definition@]
fr: @[`%s'@ n'a pas de définition préalable@]

source: A class cannot be changed from virtual to concrete
fr: Une classe ne peut être changée de virtuelle à concrète

source: A module is linked twice in the same executable.
fr: Un module est lié deux fois au sein du même exécutable.

source: A parameter has type
fr: Un paramètre a pour type

source: A potential assignment to a non-mutable value was detected in this source file. Such assignments may generate incorrect code when using Flambda.
fr: Une affectation à une variable immutable potentielle a été détectée dans ce code source. De telles affectations pourraient générer du code incorrect en combinaison avec Flambda.

source: A private type would be revealed
fr: Un type privé serait révélé

source: A single string literal is expected
fr: Un littéral de chaîne de caractère est attendu

source: A type parameter has type
fr: Un paramètre de type a pour type

source: A type parameter occurs several times
fr: Un paramètre de type apparaît plusieurs fois

source: A type variable is unbound in this extension constructor
fr: Une des variables de types n'est pas liée dans ce constructeur d'extension

source: A type variable is unbound in this type declaration
fr: Une des variables de types n'est pas liée dans cette déclaration de type

source: Absent cmi file when looking up module alias.
fr: Le fichier cmi était absent lors de la résolution d'un module alias.

source: Actual declaration
fr: Déclaration concrète

source: Already bound type parameter '%s
fr: Le paramètre de type '%s était déjà lié

source: Ambiguous constructor or label name.
fr: Nom de constructeur ou d'étiquette ambigu.

source: Ambiguous or-pattern variables under guard
fr: Motif avec alternative ambigu en présence d'une garde

source: Ambiguous or-pattern variables under guard; variable %s may match different arguments. (See manual section 9.5)
fr: Motif avec alternative ambigu en présence d'une garde %s pourrait être apparié avec des arguments différents. (Voir la section 9.5 du manuel)

source: Assignment to non-mutable value
fr: Affectation à une valeur non modifiable

source: Attribute cannot appear in this context
fr: Un attribut ne peut apparaître dans ce contexte

source: Attribute used more than once on an expression
fr: Un attribut a été utilisé plus d'une fois dans une expression
